/*упражнение 10.1*/
var i =0;
while (i < 3) {
console.log( "число i = " + i  )
  i= i +1
}

/*упражнение 10.2*/
var i =100;
while (i >= 0){
console.log('Число:' + i)
i = i-20
}

/*упражнение 10.3*/
var d,r,sum=0  //207
d=prompt ( "Введи число" ) // сохраним в d введенное число
while ( d%10==0 )
{
  d%10==0
  r = d % 10 // найдем целый остаток от деления числа на 10 2%10
  sum = sum + r
  d = Math.floor(d / 10) // округлим d / 10  до целого числа
}
console.log("sum = " + sum)


/*упражнение 10.4*/

var i=10
do {
i = i+1
console.log(i)
} while ( i < 15 )//цикл с постусловием


var i=10;
while (i < 15){
i = i+1
console.log(i)//цикс с предусловием
}

/*упражнение 10.5*/
var i =10;
for(i = i+1 ;i < 15; i++){
  console.log(i)// цикл с параметром
}

/*упражнение 10.6*/
var d,val,s = 0;
d = Number(+prompt("Введите  первое число: ", ""))

do
{
s += d *d;
console.log("Сумма квадратов введенных чисел = " + s + "   Первое число = " + d );
}
while(s <= 100)
console.log("s: " + s)

/*упражнение 10.7*/  чтобы вычислялась сумма положительных чисел и квадратов отрицательных чисел
var d,val,s = 0;
d = Number(+prompt("Введите  первое число: ", ""))

do
{ if (d>0){
  s += d;
  console.log("Сумма положительных чисел = " + s );
}
else  if (d <0) {
s += Math.pow(d,2);
  console.log("Сумма квадратов отрицательных чисел = " + s );
}

while(s <= 100)
console.log("s: " + s)
